import { LetterData, PhotoData } from '@/app/common'

import jinah1 from '../images/jinah_1.jpg'
import jinah2 from '../images/jinah_2.jpg'
import minseo1 from '../images/minseo_1.jpg'
import minseo2 from '../images/minseo_2.jpg'
import minseo3 from '../images/minseo_3.jpg'
import jinjae1 from '../images/jinjae_1.jpeg'

export const letters: LetterData[] = [
  {
    sender: '이승현',
    letter: `때로는 정답과 무관해도 지금 열의를 쏟고 있는 무언가로부터 보람을 얻을 수 있다고 믿는데요, 이것을 정수님 덕분에 많이 느끼고 배웠습니다. 항상 같은 자리에 계실 것만 같아서 더 아쉬운 마음인 것 같아요.

저는 그 꾸준함에 대해서, 다른 사람들이 10만큼 변할 때 1만큼 변하고, 벅차거나 격정적으로 표현을 드러내지는 않는 성질이지만 5년, 10년의 총합으로 결국 그것을 뛰어넘어 귀중해질 것이라고 여기거든요. 밍숭맹숭하나 쉽게 질리지 않고, 스스로 택한 것을 저버리지 않을 것이라고요. 그래서 제 미래의 모습을 상상했을 때 정수님 같은 모습이라면 좋을 것 같다고도 많이 생각하게 됐던 것 같습니다.

항상 친절하게 대해주시고 웃어주셔서 감사했습니다. 큰 힘이었어요! 반대로 저는 그렇지 못했던 것 같아서 죄송하기도 합니다. 한 집단에서 함께 일할 수 있어서 영광이었어요. 정수님만큼 좋은 곳에서 늘 행복하시기를 언제나 응원하겠습니다! 그동안 정말 고생 많으셨습니다.
`,
  },

  {
    sender: '최민서',
    letter: `정수님, 안녕하세요.

이렇게 편지를 쓰려니 참 어색하군요.
제가 입사한지 이제 막 2년이 되었고, 공연 오픈 어드민부터 정수님과 함께 일했으니 1년 좀 넘게 정수님과 같이 일한 것 같네요. 체감상으로는 3년정도 된것 같은데 그만큼 정수님께 많이 배워서 이렇게 느끼는 것 같습니다.

이것저것 업무상으로 멘탈이 흔들릴 때나 코드짤 때 어려움을 겪을 때, 많이 도와주셨던게 생각납니다.
개발에서 모르는 것들을 여쭤봤을 때 자세하게 설명해주셨던게 너무 감사했습니다. 말씀해주신 것들 잘 정리해 놓았습니다!!!! 설명해주셨던 것들 최근에도 다시 보고 있습니다. :)
그리고, 정수님과 1:1하면 항상 마음이 편해졌던 것 같아요. 덕분에 지금까지 올 수 있었고, 스스로 많이 단단해졌다고 느끼고 있습니다. 정말 항상 감사했습니다. 테아트룸의 엄마같은 존재였던 정수님이 떠나신다니 슬프기도 하고, 걱정되기도 하지만 이번 기회에 지금까지 가르쳐주셨던 것들을 기반으로 잘 헤쳐나가보겠습니다. 🫡

정수님도 이번 기회에 하고 싶으셨던 러닝, 탁구, 테니스, 여행, 영어 공부 등등 모두 하셨으면 좋겠습니다!!
여행을 가는 이유가 딱히 존재하지 않아도 막상 다른 환경에 가는 것이 새롭고, 나중에 돌아봤을 때 좋은 기억이 많더라구요!! 어디든 여행을 가신다면 인스타에 자랑해주세요!! 저도 그렇게라도 여행을 느끼고 싶군요.. 쿄쿄 🫠

퇴사하시고 꽃길만 걸으시고, 건강하시고, 즐거운 일이 가득하시길 바랄게요.
정수님은 어디서든지 잘 지내실 거에요! 응원할게요!!
종종 안부 인사드리겠습니다!! 퇴사하시고도 종종 같이 놀아요~~

2024.04.16 최민서 드림.`,
  },

  {
    sender: '이진재',
    letter: `안녕하세요 정수님. 저와 거의 비슷한 시기에 입사하신 정수님을 떠나보낸다고 생각하니 마음이 시큼합니다. 테아트룸 내에서 많은 분들께서 일로도 마음으로도 정수님께 많이 의지하셨을 겁니다. 물론 저도 그렇고요.제가 생각하는 것보다도 훨씬 더 많은 부분에서 회사에 기여하셨습니다. 정수님은 그간 테아트룸에서 대체 불가능한 개발 자원이셨기에 남아있는 사람으로서 걱정이 많이 됩니다. 그렇지만 잘 해내가야겠지요. 이전에 몇 번 정수님께 그런 말을 한 적이 있던 것 같은데 정수님을 정말 좋은 사람이라고 생각합니다. 닮고 싶은 마음과 정신을 소유한 사람이라고 생각해요. 이미 그러고 있을 것 같지만 앞으로도 좋은 분들이 정수님 곁에 모일 것이라 생각하고 또 그래서 컴퓨터로서도 인간으로서도 걱정이 되지 않는 분입니다. 좀 더 망가진 정수 님의 모습을 보고 싶었지만, 그것은 다음에 기회가 된다면 볼 수 있겠지요. 원래 사람 마음은 완벽한 사람을 보면 망가진 모습을 보고 싶은 그런 생각이 들지 않겠습니까. 3년 넘는 시간 동안 같이 일할 수 있어서 제게 행운이었고 또 항상 따뜻하게 대해주셔서 감사합니다. 회사 밖에서 또 봅시다. 고생 많으셨습니다 정수님.`,
  },

  {
    sender: '이진아',
    letter: `정수님 안녕하세요!
이렇게 편지를 쓰게 되다니.. 아직도 실감이 나지 않네요.
지금 생각해 보면 제가 맨날 점심시간에 장난치고, 술 먹고 까불거리기만 한 것 같아요.
까불거릴 때마다 정색하는 정수님 보고 더 그랬나 봐요.... 이 자리를 빌려 사과드립니다.. ☺
하지만 저는 이것도 재밌었고 정수님과 더 친해진 계기가 된 것 같아요.
이렇게 장난도 쳤지만, 업무 관련된 얘기할 때는 정확하고 원하는 바를 잘 이해해 주셔서 감사했어요. 어떻게 보면 업무적으로나 사무실 관리에 있어서 정말 의지를 많이 한 것 같아요.
여러모로 많은 부분을 도와주셔서 감사합니다.
저는 정수님이 우직한 나무 같은 분 같아요!
항상 바르고 우직한 정수님 감사했고 앞으로도 좋은 땅을 지반으로 행복하신 일만 가득하시길 바랍니다! 응원할게요!`,
    image: {
      static: jinah1,
    },
  },
]

export const photos: PhotoData[] = [
  jinah2,
  minseo1,
  minseo2,
  minseo3,
  jinjae1,
].map((staticImage) => ({ static: staticImage }))

export { histories } from '../images/history/jeongsu'
