import { LetterData, PhotoData } from '@/app/common'

import jinah1 from '../images/common/jinah_1.jpg'
import { commonImages } from '@/app/images/common'
import { jeongsuImages } from '@/app/images/jeongsu'

export const letters: LetterData[] = [
  {
    sender: '이승현',
    letter: `때로는 정답과 무관해도 지금 열의를 쏟고 있는 무언가로부터 보람을 얻을 수 있다고 믿는데요, 이것을 정수님 덕분에 많이 느끼고 배웠습니다. 항상 같은 자리에 계실 것만 같아서 더 아쉬운 마음인 것 같아요.

저는 그 꾸준함에 대해서, 다른 사람들이 10만큼 변할 때 1만큼 변하고, 벅차거나 격정적으로 표현을 드러내지는 않는 성질이지만 5년, 10년의 총합으로 결국 그것을 뛰어넘어 귀중해질 것이라고 여기거든요. 밍숭맹숭하나 쉽게 질리지 않고, 스스로 택한 것을 저버리지 않을 것이라고요. 그래서 제 미래의 모습을 상상했을 때 정수님 같은 모습이라면 좋을 것 같다고도 많이 생각하게 됐던 것 같습니다.

항상 친절하게 대해주시고 웃어주셔서 감사했습니다. 큰 힘이었어요! 반대로 저는 그렇지 못했던 것 같아서 죄송하기도 합니다. 한 집단에서 함께 일할 수 있어서 영광이었어요. 정수님만큼 좋은 곳에서 늘 행복하시기를 언제나 응원하겠습니다! 그동안 정말 고생 많으셨습니다.
`,
  },

  {
    sender: '최민서',
    letter: `정수님, 안녕하세요.

이렇게 편지를 쓰려니 참 어색하군요.
제가 입사한지 이제 막 2년이 되었고, 공연 오픈 어드민부터 정수님과 함께 일했으니 1년 좀 넘게 정수님과 같이 일한 것 같네요. 체감상으로는 3년정도 된것 같은데 그만큼 정수님께 많이 배워서 이렇게 느끼는 것 같습니다.

이것저것 업무상으로 멘탈이 흔들릴 때나 코드짤 때 어려움을 겪을 때, 많이 도와주셨던게 생각납니다.
개발에서 모르는 것들을 여쭤봤을 때 자세하게 설명해주셨던게 너무 감사했습니다. 말씀해주신 것들 잘 정리해 놓았습니다!!!! 설명해주셨던 것들 최근에도 다시 보고 있습니다. :)
그리고, 정수님과 1:1하면 항상 마음이 편해졌던 것 같아요. 덕분에 지금까지 올 수 있었고, 스스로 많이 단단해졌다고 느끼고 있습니다. 정말 항상 감사했습니다. 테아트룸의 엄마같은 존재였던 정수님이 떠나신다니 슬프기도 하고, 걱정되기도 하지만 이번 기회에 지금까지 가르쳐주셨던 것들을 기반으로 잘 헤쳐나가보겠습니다. 🫡

정수님도 이번 기회에 하고 싶으셨던 러닝, 탁구, 테니스, 여행, 영어 공부 등등 모두 하셨으면 좋겠습니다!!
여행을 가는 이유가 딱히 존재하지 않아도 막상 다른 환경에 가는 것이 새롭고, 나중에 돌아봤을 때 좋은 기억이 많더라구요!! 어디든 여행을 가신다면 인스타에 자랑해주세요!! 저도 그렇게라도 여행을 느끼고 싶군요.. 쿄쿄 🫠

퇴사하시고 꽃길만 걸으시고, 건강하시고, 즐거운 일이 가득하시길 바랄게요.
정수님은 어디서든지 잘 지내실 거에요! 응원할게요!!
종종 안부 인사드리겠습니다!! 퇴사하시고도 종종 같이 놀아요~~

2024.04.16 최민서 드림.`,
  },

  {
    sender: '이진재',
    letter: `안녕하세요 정수님. 저와 거의 비슷한 시기에 입사하신 정수님을 떠나보낸다고 생각하니 마음이 시큼합니다. 테아트룸 내에서 많은 분들께서 일로도 마음으로도 정수님께 많이 의지하셨을 겁니다. 물론 저도 그렇고요.제가 생각하는 것보다도 훨씬 더 많은 부분에서 회사에 기여하셨습니다. 정수님은 그간 테아트룸에서 대체 불가능한 개발 자원이셨기에 남아있는 사람으로서 걱정이 많이 됩니다. 그렇지만 잘 해내가야겠지요. 이전에 몇 번 정수님께 그런 말을 한 적이 있던 것 같은데 정수님을 정말 좋은 사람이라고 생각합니다. 닮고 싶은 마음과 정신을 소유한 사람이라고 생각해요. 이미 그러고 있을 것 같지만 앞으로도 좋은 분들이 정수님 곁에 모일 것이라 생각하고 또 그래서 컴퓨터로서도 인간으로서도 걱정이 되지 않는 분입니다. 좀 더 망가진 정수 님의 모습을 보고 싶었지만, 그것은 다음에 기회가 된다면 볼 수 있겠지요. 원래 사람 마음은 완벽한 사람을 보면 망가진 모습을 보고 싶은 그런 생각이 들지 않겠습니까. 3년 넘는 시간 동안 같이 일할 수 있어서 제게 행운이었고 또 항상 따뜻하게 대해주셔서 감사합니다. 회사 밖에서 또 봅시다. 고생 많으셨습니다 정수님.`,
  },

  {
    sender: '이진아',
    letter: `정수님 안녕하세요!
이렇게 편지를 쓰게 되다니.. 아직도 실감이 나지 않네요.
지금 생각해 보면 제가 맨날 점심시간에 장난치고, 술 먹고 까불거리기만 한 것 같아요.
까불거릴 때마다 정색하는 정수님 보고 더 그랬나 봐요.... 이 자리를 빌려 사과드립니다.. ☺
하지만 저는 이것도 재밌었고 정수님과 더 친해진 계기가 된 것 같아요.
이렇게 장난도 쳤지만, 업무 관련된 얘기할 때는 정확하고 원하는 바를 잘 이해해 주셔서 감사했어요. 어떻게 보면 업무적으로나 사무실 관리에 있어서 정말 의지를 많이 한 것 같아요.
여러모로 많은 부분을 도와주셔서 감사합니다.
저는 정수님이 우직한 나무 같은 분 같아요!
항상 바르고 우직한 정수님 감사했고 앞으로도 좋은 땅을 지반으로 행복하신 일만 가득하시길 바랍니다! 응원할게요!`,
    image: {
      static: jinah1,
    },
  },

  {
    sender: '박예은',
    letter: `안녕하세요 정수님, 퇴사를 하신다니 아쉽지만 어딜가시든 뭘하든 잘 해내실거라 생각합니다. 라이블리 초창기 팀원으로 시작하셔서 지금까지 일하면서 고생하셨으니 퇴사하고 푹 쉬세요~ 저만 느낀 건지 모르겠지만, 항상 점심시간마다 한숨 쉬시며 '퇴근하고 싶다, 집에 가고 싶다' 하셨는데 퇴사할 때가 되시니 좀 밝아지신 것 같아요.. 어제 퇴사하고 여행 계획, 영어 공부 계획, 운동 계획을 줄줄이 말씀하시는 모습을 보고 굉장히 부러우면서 신기했습니다. 암튼 고생하셨고 항상 응원하겠습니다!`,
  },

  {
    sender: '이찬희',
    letter: `정수님…하하…이미 수많은 분들에게 이런 편지를 써드렸지만 정수님께 써드리는 건 느낌이 참 많이 다르네요.
단순한 문장으로 다 표현하기 어렵지만 그동안 정말 많이 감사했습니다.

사실 이 회사에 온 지 얼마 안 됐을때 정수님을 보면서 굉장히 차가운 사람이라고 생각한 적이 있었어요. 가끔 선 긋는 것 같다는 생각이 들어서 저랑 잘 안 맞을 수도 있겠단 걱정을 했었는데, 그 뒤로 조금의 시간이 지나고 나서 실은 그 누구보다 정이 많은 사람이라는 것을 알게 됐습니다. 길호님, 민서님, 그리고 저에게까지 마음 써주신 것들을 경험하면서, 오히려 한번 가까워지면 그 사람들을 너무 아끼기 때문에 회사에서는 나름의 프로페셔널함을 유지하려 하셨던 게 아닌가 하는 생각을 하게 되었어요.

제가 처음 이 회사에 올 수 있게 도움 주신 순간부터 2년 간의 시간동안 가장 가까이에서 여러 가르침을 주셨던 것에 많은 감사함을 느껴요. 제가 처음에는 특히나 더 정수님을 많이 귀찮게 했던 것 같은데, 내색 한 번 안 하시고 늘 좋은 선생님이 되어주셔서 감사했습니다. 회사 업무적인 것 외에도 제가 제 커리어에 대해 갖고 있는 여러 불안감들, 회사에 대한 여러 생각들, 그 어떤 것도 편하게 털어놓고 상담할 수 있는 멘토가 되어주셔서 감사했어요. 제 첫 개발 직장에서 첫 선배로 만난 정수님은 당연히도 앞으로 늘 제 마음 속에 특별한 자리를 차지하실 겁니다.

또 회사 밖에서도 함께 운동 다니고, 페스티벌도 갔다 오고, 맛있는 것 먹는 시간들이 그동안 그저 평범한 일상처럼 지나갔는데 지금 돌아보니 너무 소중한 추억들이네요. 정수님과 진용님 두 분 덕분에 회사 안에서 쉽게 만들 수 없는 특별한 추억들을 많이 쌓을 수 있어 너무 감사하고 행복했어요.

마지막으로 3년 동안 너무 많은 스트레스와 우여곡절을 겪으면서도 회사를 잘 지켜내시느라 고생 많으셨습니다. 정수님이 이 회사에 얼마나 큰 존재인지는 제가 얘기 안 해도 다른 분들이 충분히 말씀드릴테고, 저는 이번 기회로 정수님이 그동안 씨름해왔을 여러 고민들과 스트레스로부터 온전히 자유로워지고 행복해지는 시간 잘 보내셨으면 좋겠다는 응원을 보내 드리겠습니다. 누가 누구를 걱정하냐만은, 정말 잘 쉬시고 다음에 계시게 될 곳에서도 좋은 동료들, 특히 저희처럼 정수님 잘 따르는 후배들 만나서 즐겁게 생활하셨으면 좋겠습니다.

앞으로도 또 볼 기회가 많이 있을 거라고 생각하고 마지막 인사 자체는 너무 심오하게 하지 않겠습니다!
그동안 정말 너무 고생많으셨고, 다시 한번 진심으로 감사했고 이 곳에서 만나게 되어 행운이었습니다. 많이 보고 싶을 겁니다!

- 찬희 드림 -`,
  },

  {
    sender: '오현희',
    letter: `안녕하세요 정수님, 마케터 현희입니다.

먼저 퇴사 축하드립니다! 그렇지만 마지막 인사를 하려니 슬프네요.
어떤 그룹에서 이 사람의 존재만으로도 안심이 되는 사람들이 있는데, 제게는 그 중 한 분인 정수님을 보내게 되어서 아쉽습니다.ㅠ

제가 본 정수님은 정말 믿음직한 사람입니다.
(제가 개발을 잘 아는 것은 아니지만) 정수님께서 라이블리의 회색지대를 많이 맡아주셨다고 생각해요. 어떤 일에 대해 누군가가 계속 신경쓰고 챙기고 있다는 것이 다른 사람들에게 든든함을 느끼게 하는 것 같습니다.

디피 프로젝트하실 때도 꼼꼼하게 계획을 세우고 완수하시는 점이 정말 멋졌고요.
마케팅에서 궁금하고 필요한 것들을 정수님께 많이 부탁드렸었는데 (음대전, 푸시, 디피, 대시보드, 데이터, 마케팅 링크까지... 정말 많네요) 대신해서 알아봐주시고 만들어주셔서 감사했습니다.

그동안 라이블리의 살림살이를 진아님과 함께 살뜰히 챙겨주시고, 귀찮은 배달 주문같은 일들을 도맡아 해주셔서 감사합니다. 종종 인사불성인 저를 잘 챙겨주신 것도 감사하고요^^;

또 회사의 결정에 대해 솔직하게 말해줄 수 있는 사람이 귀한데 떠난다니 아쉽군요.

고맙고 아쉬운 것은 뒤로 하고 아무튼ㅎㅎ 그동안 너무너무 고생 많으셨습니다!
푹 쉬시면서 하고 싶은 것 다 하시고요. 하시는 일 모두 잘 되시기를 진심으로 응원하겠습니다.
항상 건강하시고 행복하세요!`,
  },

  {
    sender: '김범준',
    letter: `안녕하세요 정수님, 이제 곧 다시 반말을 하게 되겠군요.. 3년이 넘는 시간동안 정말 고생 많으셨습니다. 정수님을 꼬실 때는 정말 뭣도 없는 상황이었는데 믿고 합류해주시고 오랫동안 함께해주셔서 감사드려요. 쉬운 길 놔두고 어려운 길로 가자고 한 것 같아 마음이 무겁지만 정수님에게도 이 3년이 의미 있는 시간이었기를 염치 없게 바래봅니다. 정수님이야 뭐 계속 잘 하실거고 잘 먹고 사실테니까 미래 걱정은 별로 안 드네요.. 그래도 바램이 있다면 가지신 능력 마음껏 펼치고 사시면 좋겠습니다. 근육을 늘리려면 점진적 과부하를 계속 줘야한데요. 인생이 재밌으려면 성장을 해야하고, 성장을 하려면 스트레스를 받아야만 하는 야속한 운명.. 완전 피할 순 없겠지만 덜 스트레스 받으면서도 더 크게 성장하시는 나날들이 되기를 바래요. 화이팅!!`,
  },

  {
    sender: '태서영',
    letter: `안녕하세요 정수님~~! 서영입니당.
그동안 많이 믿고 의지했던 정수님이 가신다니 싱숭생숭하네요,,

입사 후 프로덕트 기능적으로 잘 모르는 것도 많았고 실수가 잦았었는데
그럴 때마다 항상 빠르고 친절하게 하나하나 알려주시고 챙겨주셔서 너무 감사했습니다 :)
덕분에 업무를 수월하게 할 수 있었고, 많이 배울 수 있었던 것 같아요.

정수님 덕분에 언제나 모르는 것들이 생겨도 든든했고, 저 뿐만이 아닌 라이블리의 든든한 기둥이 되어주셨던 것 같아 감사했습니다!

그동안 너무 고생 많으셨고 항상 어떠한 일이든 완벽하게 해내시는 분이시니 어디에 가시든 잘 헤쳐나가실 것이라 믿고, 하시는 일마다 좋은 일이 가득하셨으면 좋겠습니다!

그리고 종종 놀러 오십셔,,,,,, 항상 행복하십셔~`,
  },

  {
    sender: '김효민',
    letter: `정수님님~
3년 넘는 시간 동안 너무 고생많으셨습니다.
제가 입사한 지도 이제 1년이 되었는데, 시간 정말 빠르네요

같이 일하면서 정수님의 모습에 많은 자극을 받았습니다. 또한 믿음과 신뢰감이 느껴지는 실력과 책임감 있게 일 처리하시는 모습에 많은 배움을 얻었습니다.

앞으로는 회사에서 얼굴 보기 힘들겠지만, 자주 연락하고 만나 뵈어요! 좋은 인연 계속 이어나가면서 서로 응원하고 격려해주는 사이 되면 좋겠습니다.

퇴사하고 나서는 푹 쉬면서 그동안 쌓인 피로도 풀고, 재충전하는 시간 가지시길 바랍니다요. 바라셨던 것처럼 1달 정도는 해외 계시면서 행복한 시간 가득하시길!

또 조만간 만나서 커피 한 잔하며 이야기 나누기를 바라기에, 나중에 볼 것처럼 길게 이야기 하지는 않겠습니다요 하핫

부담 없이 연락주시고 건강 잘 챙기시길 바라겠습니다. 다음 정거장에 더욱 원하는 결과 이루시길 바라며, 이만 줄이겠습니다.

정말 고생많으셨고, 감사했습니다`,
  },

  {
    sender: '엄진용',
    letter: `편지를 쓰는 것은 처음인 것 같구나... 민망하기도 한데, 기회가 생긴 김에 여러 생각들을 남겨본다...

이번에는 진짜로 나간다는 소식을 듣고, 회사의 실력있는 개발자가 나간다는 것은 아쉬웠지만 개인적으로는 어차피 또 보면 되니까 크게 아쉽다는 생각을 안했는데, 또 막상 닥쳐오니까 아쉬운 마음이 든다... 처음이자 아마도 마지막으로 함께 일하는 경험이었다고 생각하니 새삼 소중한 시간이었구나 하는 생각이 드네...
심화반, 메아리, 상도역 자취를 거쳐서 라이블리에 이르는, 청년기의 모든 추억을 함께 공유할 수 있는 사람이 있다는 것이 참 좋았는데, 뭔가 이제 떨어지게 된다고 생각하니 더욱 더 아쉽구나..

아쉽다는 얘기만 주구장창 적었네.. 잘 이겨내볼게..

또 하고 싶은 말은.. 그간 많이 고마웠다...

나를 이 회사에 추천해주고, 회사 생활이 처음인 나를 많이 챙겨주고, 쉴드쳐주고, 니가 몇번 퇴사 고민을 할 때에 나를 함께 고려해주었던 점 고맙다.. 그리고 평소에 늘 나에게 현실적인 조언을 해주고, 내가 힘들 때 의지할 수 있게 해줘서 고맙다..

민망하네..

수고했다.. 잘가라..`,
  },

  {
    sender: '공승민',
    letter: `저의 잦은 잠수함 패치도 묵묵히 처리해 주셨던 정수님께

제가 여기에 들어왔던 21년부터 벌써 3년이라는 시간이 흘렀네요.
스파크플러스에서부터 강남구청역 작은 연습실을 꾸민 스테이지 1호점을 거처
이수역에 있었던 스테이지 2호점에서 라이브가 끝나고 진용님과 함께 먹었던 고깃집.
마침내 신사로 사무실을 옮기고 지금의 스테이지까지
많은 성장이 있었던 만큼 정수님과의 많은 추억도 쌓인 것 같습니다.

저의 잦은 실수와 일정 딜레이, 번거로운 부탁을 해도 늘 웃으시면서 괜찮다고, 가능하다고 하시는 모습에 큰 의지가 되었고, 나도 저런 모습을 닮고 싶다고 생각했었습니다.
그런 정수 님의 자리가 빈자리가 된다니 헛헛한 마음이네요.

안녕은 영원한 헤어짐은 아닐 것이고, 정수님이 가시는 그 길이 항상 정답일 것이니 언제나 응원하겠습니다.
어쩌다 문득 '이런 사람과 함께 일을 했었다' 정도라도 남아있길 바라며 이만 글을 줄이겠습니다.

승민 올림.`,
  },
]

export const photos: PhotoData[] = [...jeongsuImages, ...commonImages].map(
  (staticImage) => ({ static: staticImage })
)

export { histories } from '../images/history/jeongsu'
