import { LetterData, PhotoData } from '@/app/common'

export const letters: LetterData[] = [
  {
    sender: '이진아',
    letter: `유나님 안녕하세요!
유나님과는 참 많은 추억이 있는 것 같은데요.
처음에 유나님께 다가가는게 조금은 어려웠는데, 막상 얘기해 보니까
그거 아시나요...? 유나님 정말 귀여우십니다....
솔직하고 강인한? 매력이 있으신 것 같아요! 일에 대한 열정을 얘기하실 때마다
나이를 떠나서 정말 대단하고 멋진 사람이라고 생각했어요.
혹시 나중에라도 또 서일페 처럼 부스 진행하시면 가서 도와드리고, 구경하러 가고 싶어요.
또 저희는 방탈출로 시작해서 라이블리의 모임의 첫 시작이 된 것 같아요.
처음에 제가 가볍게 방탈출 하고 싶다고 했는데 다들 재밌어해주셔서 이렇게까지 이어졌네요!
무서워하시면서도 열심히 문제 푸는 모습이 아직도 눈에 선해요.
퇴사하시더라도 방탈출은 계속 같이해요! 저희 홍대 제로월드 도장깨기 꼭 이뤄봐요!
앞으로도 행복한 일만 가득하시길 바랍니다!! ❤`,
  },

  {
    sender: '이진재',
    letter: `안녕하세요 유나님. 같은 파트, 같은 라이브셀에 몸담으며 많이도 부딪혔네요. 회사 내에서 사적인 자리에서 가장 얘기를 많이 나눈 분이지 않을까 싶습니다. 일을 벗어난 곳에서 유나님 때문에 화나는 일도 많고, 반대로 제가 그렇게 한 적도 많고  장난도 좀 편하게 많이 걸었던 것 같고, 돌이켜보면 회사에서 제가 느끼던 재미의 높은 지분을 유나님이 가져다주셨습니다. 또 저의 날카롭고 공격적인 생각들도 유나님이었기에 꺼낼 수 있었던 것들이 많이 있습니다. 그런 것들을 꺼낼 수 있는 사람이 회사에 있다는 것이 좋았습니다. 유나님이  회사에 가져다준 까망이, 잭, 뭉은 이제는 너무 익숙해서 그 소중함을 잊고 지내지만, 유나님이 계시지 않았다면 지금 우리가 누리고 있는 것들 중 상당수는 아마 없을 것입니다. 유나님은 똑똑하고 3D 디자인 실력도 출중하니 다른 곳에서 더 큰 꿈을 키우실 겁니다. 그렇지만 남겨 두고 가는 자식 같은 캐릭터들을 굽어살피시고 라이블리 캐릭터들 외주는 자주 맡아주시길 부탁드립니다. 3년 가까운 시간 동안 좋은 시간들을 함께해 주셔서 감사합니다. 회사 밖에서 봬요, 고생 많으셨습니다 유나님.`,
  },

  {
    sender: '최민서',
    letter: `유나님, 안녕하세요. 🥰

유나님과 업무 상으로는 겹치는 일이 많지 않았지만 캐릭터가 만들어진 것을 보면서 항상 신기했던 것 같습니다. 특히, 케일페, 서일페 준비하는 모습도 넘나 프로페셔널 해서 멋졌어요.

돌이켜보면 퇴근하고 방탈출가거나, 당구, 볼링, 맛집가기, 한강가기 등등 정말 많은 추억이 있네요. 사진첩을 보니 회사분들과 찍은 대부분의 사진이 유나님과 함께 찍은 사진입니다. 유나님이랑 놀면 항상 마음이 편했어요. 최근에 주말에 만나서 경마장 같이 간것도 너무 재밌었습니다. 내년에도 생각나시면 함 가시죠 아니면 가을도 좋습니다!!

2월에 일본 같이 간 것은 제 인생에서 계속 기억날 것 같아요. 그 당시에는 이걸 정말 가나?!?!?! 이런 느낌이 강했는데 정말 비행기 표나 숙소나 일사천리로 진행되어서 도쿄에 간것도 신기하고, 회사사람들이랑 이렇게 여행갈 수 있었던 것 도 신기했는데, 심지어 잘 맞았던 것도 신기하고 좋았습니다. 제가 미래에 도쿄에 가는 날이 있으면 계속 기억에 남을 여행이었습니다. 유나님 덕분에 좋은 추억을 가질 수 있었습니다. 감사해요 :)

이번에 베트남 가실 때도 즐거운 추억만 가득하셨으면 좋겠고, 무탈하게 다녀오시길 바라겠습니다 🙏
저 7월에 이사해야하는데, 그 때 집들이 초대할게요!! 시간되면 꼭 와주세욥ㅎㅎㅎㅎ

퇴사하시고 모든 일이 잘되고, 건강하고, 행복하시길 바랄게요!!
앞으로도 종종 방탈출 해요ㅎㅎㅎㅎ
퇴사 축하드립니다ㅣ!!


2024.04.16 최민서 드림.`,
  },

  {
    sender: '이승현',
    letter: `제가 22년도에는 아르바이트의 형태로 주말에만 일하다가 23년도에 직원으로 함께하게 되었을 때, 한 캐릭터 뒤에 이렇게나 많은 분이 계셨다니- 하고 놀랐던 기억이 있는데요. 관객을 대변하는 동시에 라이블리를 나타내기도 하는 아주 중요한 존재를 유나님께서 근사하게 가꿔주셨지요. 유나님의 손으로부터 탄생한 많은 작품 덕분에 라이블리는 한층 더 좋은 모습으로 세상에 가닿을 수 있었던 것 같습니다.

항상 먼저 말 붙여주시고 잘 대해주셔서 정말 감사했습니다. 업무적으로 겹치는 경우가 거의 없었지만, 스스로 목표하는 바에 맞추어 작업을 대하고 그것을 높은 퀄리티의 결과물로 어떻게 내보일 수 있는지 유나님 덕분에 많이 배울 수 있었어요. 그동안 정말 고생 많으셨습니다 유나님! 어디에 계시든 가장 유나님 다운 모습으로 빛나실 거라 믿어요. 늘 응원하겠습니다!`,
  },

  {
    sender: '박예은',
    letter: `유나님의 라이블리 합류 고민을 들었던 게 엊그제 같았는데 벌써 3년이 지났다니 시간이 참 빠르네요.. 3년 간 일하면서 귀엽고 자식 같은 까망이, 곰곰이, 뭉, 잭도 만들고 영상, 콘텐츠, ux/ui 등 다방면으로 일하느라 고생하셨습니다. 저도 이전 직장을 나오고, 라이블리에 합류하기 직전에 회사에 대한 고민이 굉장히 많았습니다. '내가 회사와 맞는 사람일까.. 새로운 회사를 들어가면 잘 적응할 수 있을까" 등등 고민이 많았는데 유나님 덕분에 좋은 회사에 들어오고 적응도 잘할 수 있었고 지금까지 무탈하게 다닌 것 같아요. 유나님은 여러방면으로 경험도 많고 능력도 많은 사람이라 회사를 나가서 뭘하든 잘해낼 것 같아요. 오래 고민하고 퇴사한 만큼 하고싶은 거 다 해보고, 항상 자신감 잃지말고! 저희 각자 디자인 일 하는 거 되게 재밌고 좋아하잖아요.. 여러 걱정들, 고민들 많겠지만 각자의 자리에서 오래 오래 일하고 나중에 꼭 성공하기로 해요~`,
  },

  {
    sender: '이찬희',
    letter: `유나님, 3년이라는 시간동안 정말 고생 많으셨습니다.

회사에 대한 아쉬운 부분을 가끔씩 한번 귀띔해주실 때도 설마 진짜 이렇게 빨리 가실줄은 몰랐는데, 생각보다 너무 갑작스럽게 보내드리게 되었어요. 지금까지 가셨던 팀원들에 비해서 유나님과는 본 시간도 오래 되고 함께 논 재밌는 추억이 많아서, 아마 그 빈자리가 제일 실감 날 것 같습니다. 평소에는 거의 말씀도 안 하시고 차갑게 굴다가도 술자리에서는 그 누구보다 신나게 노시는 유나님 덕분에 회사 생활에서 소소한 즐거움들을 많이 얻을 수 있어 감사했어요. 앞으로는 술 마시러 가도 그 자리가 많이 허전할 것 같습니다.

평소에 별로 말씀은 못 드렸지만 저는 항상 유나님이 우리 회사에 없어서는 안 되는 중요한 사람이라고 생각했습니다. 라이블리의 정체성인 캐릭터와 인터렉션이 생길 수 있던 건 너무나 당연한 유나님의 공이고, 또 캐일페나 서일페 때 지켜보면서 이 분이 자기 분야에서 얼마나 대단한 사람인지 여실히 느낄 수 있었어요. 자기 일에 누구보다 진심이고 열정적인 모습, 그리고 잘하는 모습이 정말 멋있었습니다.

그래서 유나님이 본인의 뜻과 열정을 좇아 회사를 떠나시는 것이 많이 속상하지만…한편으로는 그동안 속앓이 하셨을 것들이 다 잘 해결되고 마음의 자유와 행복을 얻으시기를 진심으로 바라기도 합니다. 유나님은 앞으로 더 유명해지고 크게 될 자격이 있는 분이니까, 앞으로 본인의 창의성을 마음껏 펼칠 수 있는 일들 하시면서 더 행복하셨으면 좋겠어요. 이제부터는 다른 곳에 계시더라도 이 팀 사람들이 잘하고 있나 한번씩은 생각해주시고요, 여기서 함께 경험하신 수많은 일들은 모두 기분 좋은 추억으로 가지고 가셨으면 좋겠습니다.

이제는 너무 옛날의 기억이지만 저 회사 처음 와서 회사분들끼리 술 마시러 간 게 진재님, 유나님이랑 같이 정수님 예전 집에 간 거였는데, 그때 재밌게 잘 놀아주셔서 감사했구요. 그리고 그동안 가끔식 제가 장난치고 짓궂게 놀린 것들은 다 유나님에 대한 애정의 표현이었다고 생각해주시면 감사하겠습니다.

유나님 다시 한번 정말 정말 고생 많으셨고 감사했습니다. 어딜 가나 밝고 행복한 모습으로 지내시길 응원합니다!

- 찬희 드림 -`,
  },

  {
    sender: '오현희',
    letter: `안녕하세요 유나님, 마케터 현희입니다. 오랜만에 드리는 연락인데 이렇게 마지막 인사를 하게 되어 무척이나 아쉽네요.

같은 파트로 일하면서 무척이나 즐거웠습니다. 마케팅 파트에서 회고와 새해 계획을 세우던 일, 함께 새벽까지 술을 마시던 일, 케일페를 준비하던 일, 마케팅 회식을 하던 일, 원오원 미팅까지 주마등처럼 스쳐지나가네요.

생각해보면 제가 테아트룸을 다니며 가장 의욕이 넘치고 즐거웠던 때는 마케팅 4인방 시절 같아요. 유나님과 예은, 지수님이 있어서 정말 든든했답니다. (제가 제 속을 트고 오해를 풀기까지 좀 오래 걸렸지요. 변명같지만 제가 팀장이 처음이라 많이 서툴렀습니다. 죄송하고 또 감사해요!)

그동안 너무 수고 많으셨습니다. 유나님 덕분에 브랜드의 이미지를 소위 힙하고, 하이퀄리티로 만들 수 있었고, 멋진 캐릭터 페어 프로젝트도 경험해 볼 수 있었어요. 또 각종 영상 요청 드릴 때마다 훌륭한 퀄리티로 만들어 주셔서 정말 감사했습니다.

제가 느낀 유나님은 실력도 좋고, 재능도 많고, 솔직한 성격이 강력한 장점인 것 같아요. 강력한 존재감을 가지고 계셔서 어디에 계시든 반짝반짝 빛나실 거라고 생각합니다.  앞으로 준비하시는 일들 모두 잘되시길 바라고, 항상 건강하고 행복하세요.

언젠가 제가 또 연락드릴 일이 있지 않을까요? 다음에 더 좋은 기회로 만나요 :)
유나님께서도 제 도움이 필요한 일이 있다면 편하게 연락주십쇼. 감사합니다.`,
  },

  {
    sender: '김범준',
    letter: `안녕하세요 유나님, 일본 여행 함께 다녀온게 아직도 저는 엊그제 같네요. 오랜 시간 라이블리 캐릭터들의 어머니로서 책임을 다해주셔서 정말 감사드리고 고생 너무 많으셨습니다. 유나님은 스스로도 인지하시겠지만 정말 재능러세요. 함께 하는 시간동안 그 재능을 느끼고 경험할 수 있어서 영광이었습니다. 유나님이 만들어주신 캐릭터는 라이블리의 핵심 성장 동력이었고 덕분에 지금 위치까지 올 수 있었다고 생각해요. 한편으로는 유나님이 재능을 더 펼칠 수 있는 환경을 지속해서 만들어드리지 못해 아쉽고 죄송하네요 ㅠ 미래에는 가지신 재능 폭발시키면서 슈퍼 유명한 탑 캐릭터 디자이너가 되시길 멀리서나마 응원하고 있겠습니다. 자주 놀러오세요!`,
  },

  {
    sender: '태서영',
    letter: `안녕하세요 유나님 :) 서영입니당.

우선, 그동안 너무 고생 많으셨고 라이블리에 귀여운 캐릭터들을 만들어주셔서 감사했습니다!
유나님이 만들어주신 캐릭터 덕분에 미팅에서나 아티스트 앞에서 자랑스러웠던 순간들이 많았고, 덕분에 라이블리에 대해 좋은 인상을 남길 수 있었던 것 같습니다 ㅎㅎ

유나님이 저번에 3D 캐릭터를 만들 때 너무 좋다고 하시면서 반짝이던 눈빛은 제가 봤던 유나 님 모습 중 가장 멋있었고 저 또한 제 일에 대해 많은 생각과 반성을 하게 됐던 것 같아요. 그만큼 맡으신 분야에 대해 열정 가득하시고 하고자 하시는 것들이 많은 유나님이시니 어디서 뭘 하시든 잘 해내실 거라 생각합니다 :)

파트가 달라 더 많은 추억을 쌓고 대화할 수 없었던 것이 너무 아쉽지만 그동안 유나님과 함께 놀고 협업하면서 쌓았던 추억들은 오래 오래 기억될 것 같습니다!

그동안 너무 고생 많으셨고 종종 연락해용 ㅎㅎ 회사에도 자주 놀러 오십셔!!`,
  },

  {
    sender: '김효민',
    letter: `유나님님 안녕하세여여
옆자리에 앉아 있는 사람입니다.

유나님 가시면 제 자리가 너무 허전할 것 같네여 ㅠㅠ
회사 분위기가 바뀌면서 캐릭터 말고도 다른 작업들을 주요하게 함께 하게 됐는데, 낯선 환경에서도 늘 좋은 결과물 만들어주실 때마다 유나님의 역량과 책임감에 대해 많은 자극과 배움을 얻었습니다.

회사에서 함께 하는 시간은 끝났지만, 앞으로도 종종 만나서 안부 묻고 커피 한 잔 종종 할 수 있으면 좋겠습니다.

다음 정거장에서는 유나님이 원하고 바라시는 일들을 더 주체적으로 하실 수 있기를 응원하겠습니다.

항상 건강하시고, 앞으로 가는 길마다 행운이 함께하기를!
또 만날 것이기에 더 길게 적지 않고 이만 줄이겠습니다 ㅎㅎ`,
  },

  {
    sender: '엄진용',
    letter: `유나님,

회사에서는 업무가 겹치지 않아서 교류가 많이 없었지만,

술자리를 자주 함께 하다보니 정이 많이 들었는데, 이렇게 가신다고 하니 정말 아쉽습니다.

술을 좋아하시니 언젠가 또 술자리에서 뵐 수 있으리라 기대하겠습니다,,

외주도 가끔 하실 예정이라고 하셨으니, 자주 놀러오셔서 또 함께 놀 수 있으면 좋겠습니다.

그동안 정말 고생많으셨고, 제가 인생에서 처음 만난 캐릭터 디자이너가 유나님 같이 실력있고 열정있는 분이셔서 정말 좋았습니다. 진심입니다.

그간 고생많으셨습니다. 대성하십쇼!!`,
  },

  {
    sender: '공승민',
    letter: `오늘 날이 있기까지 많은 고민이 있으셨을 까망, 뭉, 잭, 곰곰의 엄마 유나님께

라이블리에서 까망이와 캐릭터 굿즈들로 저에게 새로운 가능성과 그 가능성에 확신을 느끼게 해주셨던 유나님이 떠나신다니....물론 이전부터 고민이 많으셨고, 여러 이야기를 해 주셨지만, 그래도 내심 남아주셨으면 했던 욕심이 있었던 것 같아요.

유나님이 만들어주신 캐릭터들로 하고 싶은 것이 많았고, 하고 싶은 것들이 많은 만큼 모두 이루어내지 못했지만 그 아쉬운 만큼 유나님을 보내기 아쉽습니다. 유나님과 캐릭터에 대한 욕심을 마음껏 이야기할 수 있어서 너무 좋았고 감사했습니다.

까망과 뭉, 잭, 곰곰이 말고도 멍소녀도 이불이도 크로플, 유나님 작업물 모두 너무 좋았고, 앞으로도 멋진 작업물 많이 볼 수 있었으면 좋겠습니다.
비록 회사에선 이렇게 헤어지지만 개인 작업으로 만날 수 있으면 만나 뵈어요.
여태 고생 많으셨고, 하시려는 일 모두 응원하겠습니다.

승민 올림.`,
  },
]

export const photos: PhotoData[] = []

export { histories } from '../images/history/yuna'
